{"config": {"layers": [{"config": {"dilation_rate": [1, 1], "batch_input_shape": [null, 256, 64, 1], "kernel_size": [4, 4], "activity_regularizer": null, "strides": [1, 1], "dtype": "float32", "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 32, "name": "conv2d_1", "kernel_constraint": null, "data_format": "channels_last", "activation": "relu", "padding": "same", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_1", "padding": "valid", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "dtype": "float32", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"dilation_rate": [1, 1], "batch_input_shape": [null, 256, 64, 1], "kernel_size": [3, 3], "activity_regularizer": null, "strides": [1, 1], "dtype": "float32", "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "name": "conv2d_2", "kernel_constraint": null, "data_format": "channels_last", "activation": "relu", "padding": "same", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_2", "padding": "valid", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "dtype": "float32", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"dilation_rate": [1, 1], "batch_input_shape": [null, 256, 64, 1], "kernel_size": [2, 2], "activity_regularizer": null, "strides": [1, 1], "dtype": "float32", "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 128, "name": "conv2d_3", "kernel_constraint": null, "data_format": "channels_last", "activation": "relu", "padding": "same", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_3", "padding": "valid", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "dtype": "float32", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"dilation_rate": [1, 1], "batch_input_shape": [null, 256, 64, 1], "kernel_size": [2, 2], "activity_regularizer": null, "strides": [1, 1], "dtype": "float32", "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 256, "name": "conv2d_4", "kernel_constraint": null, "data_format": "channels_last", "activation": "relu", "padding": "same", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "name": "flatten_1", "dtype": "float32", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "dtype": "float32", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "dense_1", "activation": "linear", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 256, "bias_constraint": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "dtype": "float32", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "dense_2", "activation": "linear", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 128, "bias_constraint": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "dtype": "float32", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "dense_3", "activation": "linear", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 64, "bias_constraint": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "dtype": "float32", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "dense_4", "activation": "linear", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 32, "bias_constraint": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "dtype": "float32", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "dense_5", "activation": "softmax", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 13, "bias_constraint": null, "use_bias": true}, "class_name": "Dense"}], "name": "sequential_1"}, "keras_version": "2.3.1", "class_name": "Sequential", "backend": "tensorflow"}