{"class_name": "Sequential", "config": {"layers": [{"class_name": "Conv2D", "config": {"activation": "relu", "trainable": true, "kernel_regularizer": null, "padding": "same", "name": "conv2d_34", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_size": [4, 4], "kernel_constraint": null, "filters": 32, "dtype": "float32", "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "strides": [1, 1], "data_format": "channels_last", "batch_input_shape": [null, 256, 64, 1], "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "dtype": "float32", "padding": "valid", "name": "max_pooling2d_26", "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"activation": "relu", "trainable": true, "kernel_regularizer": null, "padding": "same", "name": "conv2d_35", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "filters": 64, "dtype": "float32", "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "strides": [1, 1], "data_format": "channels_last", "batch_input_shape": [null, 256, 64, 1], "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "dtype": "float32", "padding": "valid", "name": "max_pooling2d_27", "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"activation": "relu", "trainable": true, "kernel_regularizer": null, "padding": "same", "name": "conv2d_36", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_size": [2, 2], "kernel_constraint": null, "filters": 128, "dtype": "float32", "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "strides": [1, 1], "data_format": "channels_last", "batch_input_shape": [null, 256, 64, 1], "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "dtype": "float32", "padding": "valid", "name": "max_pooling2d_28", "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"activation": "relu", "trainable": true, "kernel_regularizer": null, "padding": "same", "name": "conv2d_37", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_size": [2, 2], "kernel_constraint": null, "filters": 256, "dtype": "float32", "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "strides": [1, 1], "data_format": "channels_last", "batch_input_shape": [null, 256, 64, 1], "bias_constraint": null}}, {"class_name": "Flatten", "config": {"trainable": true, "data_format": "channels_last", "dtype": "float32", "name": "flatten_9"}}, {"class_name": "Dense", "config": {"activation": "linear", "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "units": 256, "name": "dense_47", "dtype": "float32", "bias_constraint": null}}, {"class_name": "Dense", "config": {"activation": "linear", "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "units": 128, "name": "dense_48", "dtype": "float32", "bias_constraint": null}}, {"class_name": "Dense", "config": {"activation": "linear", "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "units": 64, "name": "dense_49", "dtype": "float32", "bias_constraint": null}}, {"class_name": "Dense", "config": {"activation": "linear", "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "units": 32, "name": "dense_50", "dtype": "float32", "bias_constraint": null}}, {"class_name": "Dense", "config": {"activation": "softmax", "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "units": 13, "name": "dense_51", "dtype": "float32", "bias_constraint": null}}], "name": "sequential_9"}, "backend": "tensorflow", "keras_version": "2.3.1"}